app/views/pages/index.html.erb

      <% end %> <br />
      Votes: <%= link.votes.where(:up => true).count - link.votes.where(:up => false).count %>
---
SELECT COUNT(*) FROM "votes" WHERE "votes"."link_id" = 11 AND "votes"."up" = 't'