app/views/links/show.html.erb

SELECT "comments".* FROM "comments" WHERE "comments"."link_id" = 15
---
<div class="comments">
  <% @link.comments.each do |comment| %>