app/controllers/comments_controller.rb

INSERT INTO "comments" ("created_at", "link_id", "message", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["created_at", Tue, 11 Sep 2012 08:22:40 UTC +00:00], ["link_id", 15], ["message", "This is my first comment!"], ["updated_at", Tue, 11 Sep 2012 08:22:40 UTC +00:00], ["user_id", 3]]
---
  def create
    @comment = current_user.comments.create(params[:comment])