app/controllers/links_controller.rb

  def show
    @link = Link.find(params[:id])
---
SELECT "links".* FROM "links" WHERE "links"."id" = ? LIMIT 1  [["id", "3"]]

  def create
    @link = Link.new(params[:link])
    @link.voteCount = 0

    respond_to do |format|
      if @link.save
---
INSERT INTO "links" ("created_at", "title", "updated_at", "url", "user_id") VALUES (?, ?, ?, ?, ?)  [["created_at", Tue, 11 Sep 2012 00:24:07 UTC +00:00], ["title", "test"], ["updated_at", Tue, 11 Sep 2012 00:24:07 UTC +00:00], ["url", "testurl"], ["user_id", nil]]