app/controllers/pages_controller.rb

  def index
    params[:per_page] ||= 5
    params[:page]     ||= 1

    @links = Link.order('"voteCount" DESC').paginate(:page => params[:page], :per_page => params[:per_page])
---
SELECT "links".* FROM "links" ORDER BY created_at DESC LIMIT 25 OFFSET 0
SELECT COUNT(*) FROM "links"