app/controllers/votes_controller.rb

INSERT INTO "votes" ("created_at", "link_id", "up", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["created_at", Fri, 14 Sep 2012 00:56:27 UTC +00:00], ["link_id", nil], ["up", nil], ["updated_at", Fri, 14 Sep 2012 00:56:27 UTC +00:00], ["user_id", 3]]
SELECT "votes".* FROM "votes" WHERE "votes"."user_id" = 3 AND "votes"."link_id" = 11 LIMIT 1
UPDATE "links" SET "voteCount" = -1, "updated_at" = '2012-09-14 06:16:48.898690' WHERE "links"."id" = 14
UPDATE "votes" SET "up" = 'f', "updated_at" = '2012-09-14 01:55:42.851855' WHERE "votes"."id" = 11
SELECT "links".* FROM "links" WHERE "links"."id" = 11 LIMIT 1
---
  def create
    @vote = current_user.votes.where(:link_id => params[:vote][:link_id]).first || current_user.votes.create(params[:vote])
    @vote.update_attributes(:up => params[:vote][:up])

    @link = Link.where(:id => @vote.link_id).first